questions = {
    "informated": 'Какие из этих материалов вы прочитали?',
    "prize_fund": 'Какой призовой фонд на Хакатоне?',
    "expectation": 'Что от вас ожидают на хакатоне в первую очередь?',
    "advantage": 'Что из этого является преимуществом работы в Латокен?',
    "salary": 'Каковы Ваши зарплатные ожидания в USD?',
    "schedule": 'Какое расписание Хакатона корректнее?',
    "venture_fund": 'Каковы признаки "Wartime CEO" согласно крупнейшему венчурному фонду a16z?',
    "want": 'Что Латокен ждет от каждого члена команды?',
    "exam": 'Представьте вы на выпускном экзамене. Ваш сосед слева просит вас передать ответы от соседа справа. Вы поможете?',
    "task": 'Кирпич весит килограмм и еще пол-кирпича. Сколько весит кирпич?',
    "opinion": 'Напишите ваши "за" и "против" работы в Латокен? Чем подробнее, тем лучше - мы читаем.'
}

answers = {
    "informated": {
        1: 'О Хакатоне deliver.latoken.com/hackathon',
        2: 'О Латокен deliver.latoken.com/about',
        3: 'Большая часть из #nackedmanagement coda.io/@latoken/latoken-talent/nakedmanagement-88'
    },
    "prize_fund": {
        1: '25,000 Опционов',
        2: '100,000 Опционов или 10,000 LA',
        3: 'Только бесценный опыт'
    },
    "expectation": {
        1: 'Показать мои способности узнавать новые технологии',
        2: 'Показать работающий сервис',
        3: 'Продемонстрировать навыки коммуникации и командной работы'
    },
    "advantage": {
        1: 'Быстрый рост через решение нетривиальных задач',
        2: 'Передовые технологии AIxWEB3',
        3: 'Глобальный рынок, клиенты в 200+ странах',
        4: 'Возможность совмещать с другой работой и хобби',
        5: 'Самая успешная компания из СНГ в WEB3',
        6: 'Удаленная работа, но без давншифтинга',
        7: 'Оплата в твердой валюте, без привязки к банкам',
        8: 'Опционы с "откешиванием" криптолетом',
        9: 'Комфортная среда для свободы творчества'
    },
    "schedule": {
        1: 'Пятница: 18:00 Разбор задач. Суббота: 18:00 Демо результатов, 19-00 объявление победителей, интервью и офферы',
        2: 'Суббота: 12:00 Презентация компании, 18:00 Презентации результатов проектов'
    },
    "venture_fund": {
        1: 'Сосредотачивается на общей картине и дает сотрудникам принимать детальные решения на общей картине и дает команде возможность принимать детальные решения',
        2: 'Употребляет ненормативную лексику, кричит, редко говорит спокойным тоном',
        3: 'Терпит отклонения от плана, если они связаны с усилиями и творчеством',
        4: 'Не терпит отклонений от плана',
        5: 'Обучает своих сотрудников для обеспечения их удовлетворенности и карьерного развития',
        6: 'Тренерует сотрудников, так чтобы им не прострелили зад на поле боя'
    },
    "want": {
        1: 'Спокойной работы без излишнего стресса',
        2: 'Вникания в блокеры вне основного стека, чтобы довести свою задачу до прода',
        3: 'Тестирование продукта',
        4: 'Субординацию, и не вмешательство чужие дела',
        5: 'Вежливость и корректность в коммуникации',
        6: 'Измерение результатов',
        7: 'Демонстрацию результатов в проде каждую неделю'
    },
    "exam": {
        1: 'Да',
        2: 'Да, но если преподаватель точно не увидит',
        3: 'Да, но только если мне тоже помогут',
        4: 'Нет',
        5: 'Нет, если мне не дадут посмотреть эти ответы',
        6: 'Нет, если это может мне повредить'
    },
    "task": {
        1: '1 кг',
        2: '1.5 кг',
        3: '2 кг',
        4: '3 кг'
    }
}
